{
  "_name_or_path": "facebook/wav2vec2-base-960h",
  "activation_dropout": 0.1,
  "adapter_kernel_size": 3,
  "adapter_stride": 2,
  "add_adapter": false,
  "apply_spec_augment": true,
  "architectures": [
    "Wav2Vec2ForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": 1,
  "classifier_proj_size": 256,
  "codevector_dim": 256,
  "contrastive_logits_temperature": 0.1,
  "conv_bias": false,
  "conv_dim": [
    512,
    512,
    512,
    512,
    512,
    512,
    512
  ],
  "conv_kernel": [
    10,
    3,
    3,
    3,
    3,
    2,
    2
  ],
  "conv_stride": [
    5,
    2,
    2,
    2,
    2,
    2,
    2
  ],
  "ctc_loss_reduction": "sum",
  "ctc_zero_infinity": false,
  "diversity_loss_weight": 0.1,
  "do_stable_layer_norm": false,
  "eos_token_id": 2,
  "feat_extract_activation": "gelu",
  "feat_extract_dropout": 0.0,
  "feat_extract_norm": "group",
  "feat_proj_dropout": 0.1,
  "feat_quantizer_dropout": 0.0,
  "final_dropout": 0.1,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout": 0.1,
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Andean Guan",
    "1": "Andean Tinamou",
    "2": "Australian Brushturkey",
    "3": "Band-tailed Guan",
    "4": "Bartletts Tinamou",
    "5": "Bearded Guan",
    "6": "Black-capped Tinamou",
    "7": "Blue-throated Piping Guan",
    "8": "Brazilian Tinamou",
    "9": "Brown Tinamou",
    "10": "Brushland Tinamou",
    "11": "Cauca Guan",
    "12": "Chaco Chachalaca",
    "13": "Chestnut-winged Chachalaca",
    "14": "Cinereous Tinamou",
    "15": "Colombian Chachalaca",
    "16": "Crested Guan",
    "17": "Dusky Megapode",
    "18": "Dusky-legged Guan",
    "19": "Dwarf Tinamou",
    "20": "Great Tinamou",
    "21": "Grey Tinamou",
    "22": "Grey-headed Chachalaca",
    "23": "Highland Tinamou",
    "24": "Little Chachalaca",
    "25": "Little Tinamou",
    "26": "Orange-footed Scrubfowl",
    "27": "Pale-browed Tinamou",
    "28": "Plain Chachalaca",
    "29": "Red-legged Tinamou",
    "30": "Red-winged Tinamou",
    "31": "Rufous-bellied Chachalaca",
    "32": "Rufous-headed Chachalaca",
    "33": "Rufous-vented Chachalaca",
    "34": "Rusty-margined Guan",
    "35": "Slaty-breasted Tinamou",
    "36": "Small-billed Tinamou",
    "37": "Solitary Tinamou",
    "38": "Speckled Chachalaca",
    "39": "Spixs Guan",
    "40": "Spotted Nothura",
    "41": "Tataupa Tinamou",
    "42": "Tawny-breasted Tinamou",
    "43": "Thicket Tinamou",
    "44": "Undulated Tinamou",
    "45": "Variegated Tinamou",
    "46": "West Mexican Chachalaca",
    "47": "White-bellied Nothura",
    "48": "White-throated Tinamou",
    "49": "Yellow-legged Tinamou"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_10": 10,
    "LABEL_11": 11,
    "LABEL_12": 12,
    "LABEL_13": 13,
    "LABEL_14": 14,
    "LABEL_15": 15,
    "LABEL_16": 16,
    "LABEL_17": 17,
    "LABEL_18": 18,
    "LABEL_19": 19,
    "LABEL_2": 2,
    "LABEL_20": 20,
    "LABEL_21": 21,
    "LABEL_22": 22,
    "LABEL_23": 23,
    "LABEL_24": 24,
    "LABEL_25": 25,
    "LABEL_26": 26,
    "LABEL_27": 27,
    "LABEL_28": 28,
    "LABEL_29": 29,
    "LABEL_3": 3,
    "LABEL_30": 30,
    "LABEL_31": 31,
    "LABEL_32": 32,
    "LABEL_33": 33,
    "LABEL_34": 34,
    "LABEL_35": 35,
    "LABEL_36": 36,
    "LABEL_37": 37,
    "LABEL_38": 38,
    "LABEL_39": 39,
    "LABEL_4": 4,
    "LABEL_40": 40,
    "LABEL_41": 41,
    "LABEL_42": 42,
    "LABEL_43": 43,
    "LABEL_44": 44,
    "LABEL_45": 45,
    "LABEL_46": 46,
    "LABEL_47": 47,
    "LABEL_48": 48,
    "LABEL_49": 49,
    "LABEL_5": 5,
    "LABEL_6": 6,
    "LABEL_7": 7,
    "LABEL_8": 8,
    "LABEL_9": 9
  },
  "layer_norm_eps": 1e-05,
  "layerdrop": 0.1,
  "mask_feature_length": 10,
  "mask_feature_min_masks": 0,
  "mask_feature_prob": 0.0,
  "mask_time_length": 10,
  "mask_time_min_masks": 2,
  "mask_time_prob": 0.05,
  "model_type": "wav2vec2",
  "num_adapter_layers": 3,
  "num_attention_heads": 12,
  "num_codevector_groups": 2,
  "num_codevectors_per_group": 320,
  "num_conv_pos_embedding_groups": 16,
  "num_conv_pos_embeddings": 128,
  "num_feat_extract_layers": 7,
  "num_hidden_layers": 12,
  "num_negatives": 100,
  "output_hidden_size": 768,
  "pad_token_id": 0,
  "proj_codevector_dim": 256,
  "tdnn_dilation": [
    1,
    2,
    3,
    1,
    1
  ],
  "tdnn_dim": [
    512,
    512,
    512,
    512,
    1500
  ],
  "tdnn_kernel": [
    5,
    3,
    3,
    1,
    1
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.28.1",
  "use_weighted_layer_sum": false,
  "vocab_size": 32,
  "xvector_output_dim": 512
}
